{
  "radiant" : {
    "aboutProject": {
      "header": "О проекте",
      "paragraph": "Этот проект представлял собой веб-приложение для калибровки различных типов камер, включая зеркальные фотоаппараты, камеры мобильных устройств, медицинские камеры и другие специализированные устройства. Главной целью было предоставить пользователям удобный инструмент для точной настройки их камер путем последовательного анализа изображений и вычислений."
    },
    "calibrationProcess": {
      "header": "Процесс калибровки",
      "subheader": "Процесс калибровки состоял из нескольких этапов:",
      "list": [
        "Ввод данных о мониторе — пользователь указывал размер экрана и разрешение, чтобы правильно масштабировать тестовые паттерны.",
        "Генерация паттернов — система создавала черно-белые шаблоны с QR-кодами в центре, позволяющими программе идентифицировать порядок кадров.",
        "Съемка процесса калибровки — пользователь запускал презентацию на сайте, где паттерны менялись каждую секунду. В этот момент он записывал процесс на свою камеру, строго фиксируя ее на штативе.",
        "Загрузка фото или видео — пользователи загружали отснятые файлы в систему, причем для точной калибровки требовалось несколько съемок с разными углами.",
        "Анализ позиций камеры — система определяла позиции камеры на основе загруженных материалов, после чего пользователь мог вручную корректировать данные.",
        "Финальная калибровка — обработка информации на сервере с последующим выводом статистики в виде графиков и данных, доступных для скачивания в различных форматах."
      ]
    },
    "challenges": {
      "header": "Основные задачи и вызовы",
      "paragraphs": [
        "Одной из сложных задач было создание интуитивно понятного интерфейса для калибровки. Процесс требовал высокой точности, поэтому дизайн должен был помогать пользователям легко ориентироваться в сложных шагах настройки камеры.",
        "Я участвовал в подключении SSO через Keycloak, а также реализовал поллинг для корректного отображения статусов калибровки во время взаимодействия пользователя с системой."
      ]
    },
    "commercial": {
      "header": "Коммерческое применение",
      "paragraph": "Этот проект разрабатывался как коммерческий продукт, предлагающий более удобный и точный метод калибровки камер. Мы планировали продавать его как инновационное решение для профессиональных пользователей в области 3D-моделирования, медицины и других высокоточных сфер."
    }
  },
  "ciCraft": {
    "aboutProject": {
      "header": "О проекте",
      "paragraph": "Ci Craft — это мобильная обучающая игра, разработанная для изучения китайских иероглифов. Игра была доступна как мини-приложение во ВКонтакте и представляла собой креативный подход к освоению китайской письменности через механику «собери иероглиф». Визуальный стиль проекта был вдохновлён древним Китаем и оформлен в тёплых оранжевых тонах."
    },
    "gameplay": {
      "header": "Игровой процесс",
      "paragraph": "Игрок выбирал уровень — это был определённый пакет иероглифов. Цель уровня заключалась в том, чтобы из простых ключей Канси (основных компонентов китайских иероглифов) собрать более сложные символы. Ключи прокручивались внизу экрана в виде карусели. Игрок перетаскивал нужные элементы на рабочую область, и при правильной комбинации они превращались в цельный иероглиф, который автоматически добавлялся в личный словарь."
    },
    "dictionary": {
      "header": "Словарь и обучение",
      "paragraph": "Ci Craft предлагал встроенный словарь, где пользователи могли: просматривать изученные иероглифы по уровням; добавлять символы в свои личные папки; изучать краткую историю происхождения каждого иероглифа. Таким образом, игра не только тренировала память и визуальное восприятие, но и формировала личный справочник китайских символов."
    },
    "audience": {
      "header": "Целевая аудитория",
      "paragraph": "Игра разрабатывалась для широкой аудитории — от школьников до взрослых, желающих начать или повторить основы китайского языка. Простой интерфейс и увлекательный подход делали её доступной для любого возраста и уровня подготовки."
    },
    "myRole": {
      "header": "Моя роль в проекте",
      "list": [
        "Разработка модуля словаря и интерфейса карточек иероглифов",
        "Создание макетов всех экранов (UI-дизайн)",
        "Исправление багов, связанных с игровым процессом",
        "Настройка административной панели (React + Firebase)"
      ]
    },
    "technicalChallenges": {
      "header": "Технические особенности и вызовы",
      "paragraph": "Проект был построен на React Ionic и использовал Firebase в качестве базы данных. Также была интеграция с VK API для запуска внутри соцсети. Одной из сложностей была кроссплатформенность — на iOS возникали ограничения, связанные с безопасностью и поведением компонентов, которые требовали нестандартных решений."
    },
    "results": {
      "header": "Результаты",
      "paragraph": "Был проведён тестовый запуск среди ограниченного круга пользователей ВКонтакте. Пользователи положительно оценили оригинальность идеи и визуальный стиль, однако из-за ограниченного количества уровней и отсутствия финального геймифицированного цикла, развитие проекта было приостановлено."
    },
    "meaning": {
      "header": "Значение проекта",
      "paragraph": "Ci Craft стал для меня важным первым шагом в профессиональной разработке. Благодаря нему я научился работать в команде, погрузился в разработку интерфейсов для мобильных платформ и расширил навыки проектирования пользовательского опыта."
    }
  },
  "bretzel": {
    "aboutProject": {
      "header": "О проекте",
      "paragraph": "Bretzel — это внутреннее корпоративное веб-приложение, разработанное для сотрудников крупной немецкой компании. Основная цель проекта заключалась в создании удобного сервиса для заказа еды на различные корпоративные мероприятия и повседневные нужды. Приложение поддерживает мобильные и настольные устройства, что позволяет сотрудникам быстро и просто оформить заказ вне зависимости от используемого устройства."
    },
    "mainFunctionality": {
      "header": "Основной функционал",
      "paragraph": "Пользователь выбирает тип события (например, Cafeteria, Breakfast, BBQ, Coffee Break, Finger food, Pizza session), после чего переходит на страницу с формой, где указывает место проведения, дату и время. Далее открывается меню, автоматически подстраивающееся под выбранное событие. Сотрудник собирает корзину, оплачивает заказ и может отслеживать его статус на отдельной странице: видеть, какие заказы уже готовы, а какие еще в работе. Вторая часть приложения предназначена для шефа — исполнителя заказов. В этом разделе он может настраивать меню, отмечать выходные дни, а также управлять списком популярных мест доставки."
    },
    "myRole": {
      "header": "Моя роль",
      "paragraph": "Я отвечал за полный цикл дизайна интерфейса как для мобильной, так и для десктопной версии приложения. Также занимался разработкой ключевых пользовательских сценариев: оформление заказа, фильтрация и отображение меню, корзина продуктов и взаимодействие с ней."
    },
    "technologies": {
      "header": "Технологии и особенности",
      "paragraph": "Приложение построено на React с использованием MobX для управления состоянием. Несмотря на то, что это SPA, проект оказался технически сложным из-за большого количества условий и сценариев, которые нужно было учесть: корректная работа с датой и временем доставки, актуализация статусов заказов, динамическое обновление корзины и меню."
    },
    "challenges": {
      "header": "Сложности и решения",
      "paragraph": "Одной из главных задач было обеспечить корректную работу с временными слотами и статусами заказов, а также реализовать гибкую фильтрацию и обновление меню в зависимости от выбранного события. Все эти возможности требовали тщательной проработки логики и тесного взаимодействия с командой бэкенда."
    },
    "results": {
      "header": "Результаты",
      "paragraph": "Приложение оказалось востребованным среди сотрудников компании и продолжает использоваться по сей день. Заказчики остались довольны результатом и впоследствии обратились к нам с новыми идеями для дальнейших проектов."
    }
  },
  "squadReady": {
    "aboutProject": {
      "header": "О проекте",
      "paragraph": "Squad Ready IT — это лендинг компании, специализирующейся на аутсорс-разработке программного обеспечения. Основная цель сайта — привлечение новых клиентов и презентация портфолио компании. Для этого была проведена тщательная работа по SEO, чтобы сайт был максимально заметен в поисковых системах."
    },
    "mainFunctionality": {
      "header": "Основной функционал",
      "paragraph": "На сайте акцент сделан на возможности компании брать в работу проекты любой сложности, а при необходимости — быстро расширять команду за счёт привлечения дополнительных специалистов. В блоках лендинга отражён опыт сотрудничества с разными компаниями, а также представлены реализованные проекты с оригинальными иллюстрациями-превью."
    },
    "myRole": {
      "header": "Моя роль",
      "paragraph": "Я полностью разработал дизайн лендинга, создал иллюстрации для превью проектов и реализовал сайт на Next.js. Весь процесс — от идеи до финальной реализации — был выполнен мной самостоятельно."
    },
    "technologies": {
      "header": "Технологии и особенности",
      "paragraph": "Сайт построен на Next.js с использованием React и библиотеки компонентов MUI. Особое внимание уделялось простоте и лаконичности интерфейса, а также плавным анимациям, которые делают взаимодействие с сайтом более приятным."
    },
    "challenges": {
      "header": "Сложности и решения",
      "paragraph": "Особый интерес вызвала работа над анимациями: хотя их не так много, они добавляют сайту индивидуальности, особенно при смене проектов во время прокрутки страницы."
    },
    "results": {
      "header": "Результаты",
      "paragraph": "Сайт получил высокую оценку руководителя компании и до сих пор используется как визитная карточка Squad Ready IT. После успешного запуска мне доверили разработку ещё одного подобного проекта."
    }
  },
  "kanxiKeys": {
    "aboutProject": {
      "header": "О проекте",
      "paragraph": "Интерактивный сайт «Таблица ключей Канси» создан для всех, кто интересуется китайским языком и хочет глубже познакомиться с 214 основными иероглифическими ключами. Проект совмещает образовательную и коммерческую задачи: на сайте можно не только изучать ключи, но и приобрести иллюстрированный плакат с их подробным описанием на Ozon. Также через сайт рекламируется тематическое сообщество ВКонтакте, где публикуется полезный контент для изучающих китайский."
    },
    "mainFunctionality": {
      "header": "Основной функционал",
      "paragraph": "В центре сайта — удобная интерактивная таблица, где представлены все 214 ключей Канси. Для каждого ключа доступна отдельная статья с историей, значением и другой полезной информацией. Реализован быстрый поиск по ключам, а также сортировка по количеству черт в иероглифе, что облегчает навигацию и поиск нужного элемента. В правом нижнем углу размещена кнопка помощи, открывающая модальное окно с пояснениями по интерфейсу."
    },
    "myRole": {
      "header": "Моя роль",
      "paragraph": "Я отвечал за весь дизайн сайта, стремясь передать атмосферу Китая через мягкие светлые тона и ненавязчивые детали. Также занимался анимациями, настройкой бэкенда, реализацией поиска, сортировки по количеству черт и адаптацией интерфейса для мобильных и настольных устройств."
    },
    "technologies": {
      "header": "Технологии и особенности",
      "paragraph": "Сайт реализован на Next.js с использованием базы данных Firebase. Особое внимание уделялось скорости загрузки, адаптивности и удобству навигации. Благодаря продуманному дизайну и современному подходу к интерфейсу, сайт выгодно выделяется среди аналогичных ресурсов."
    },
    "challenges": {
      "header": "Сложности и решения",
      "paragraph": "Проект не вызвал серьёзных сложностей, но был очень интересен с точки зрения дизайна и реализации интерактивных элементов. Особенно горжусь тем, что удалось создать приятную атмосферу и сделать сайт действительно удобным для пользователей."
    },
    "results": {
      "header": "Результаты",
      "paragraph": "Сайт получил множество положительных отзывов за удобство и визуальное оформление. Пользователи отмечают, что работать с таблицей приятно и просто. Проект был реализован в 2022 году и продолжает использоваться по сей день."
    }
  },
  "planyway": {
    "aboutProject": {
      "header": "О проекте",
      "paragraph": "Planyway — это крупное веб-приложение для управления задачами и временем с интеграциями Trello и Jira. Приложение сочетает в себе возможности планирования, отслеживания времени и формирования отчетов."
    },
    "myContribution": {
      "header": "Мой вклад",
      "subtitle": "Я присоединился к проекту в 2024 году как frontend-разработчик. За это время я:",
      "list": [
        "Реализовал новый онбординг для пользователей",
        "Доработал функцию экспорта отчетов в различные форматы",
        "Добавил параметр «оплачиваемые и не оплачиваемые часы» в логи времени",
        "Переработал основное меню фильтрации задач",
        "Поддерживал интеграции с Jira, Trello и расширением для Chrome",
        "Участвовал в разработке нового функционала и исправлении багов на backend (Node.js)"
      ]
    },
    "architecture": {
      "header": "Архитектурные улучшения",
      "paragraph": "Внедрил архитектурный подход Feature-Sliced Design, что позволило структурировать проект, упростить навигацию по коду и сделать его более удобным для поддержки и развития."
    },
    "challenges": {
      "header": "Особенности работы",
      "paragraph": "Основная сложность заключалась в необходимости разбираться в большом объёме устаревшего кода. Постепенно удаётся упростить и обновить проект, сделать его более современным и удобным для дальнейшей работы."
    }
  }
}