{
  "radiant" : {
    "aboutProject": {
      "header": "О проекте",
      "paragraph": "Этот проект представлял собой веб-приложение для калибровки различных типов камер, включая зеркальные фотоаппараты, камеры мобильных устройств, медицинские камеры и другие специализированные устройства. Главной целью было предоставить пользователям удобный инструмент для точной настройки их камер путем последовательного анализа изображений и вычислений."
    },
    "calibrationProcess": {
      "header": "Процесс калибровки",
      "subheader": "Процесс калибровки состоял из нескольких этапов:",
      "list": [
        "Ввод данных о мониторе — пользователь указывал размер экрана и разрешение, чтобы правильно масштабировать тестовые паттерны.",
        "Генерация паттернов — система создавала черно-белые шаблоны с QR-кодами в центре, позволяющими программе идентифицировать порядок кадров.",
        "Съемка процесса калибровки — пользователь запускал презентацию на сайте, где паттерны менялись каждую секунду. В этот момент он записывал процесс на свою камеру, строго фиксируя ее на штативе.",
        "Загрузка фото или видео — пользователи загружали отснятые файлы в систему, причем для точной калибровки требовалось несколько съемок с разными углами.",
        "Анализ позиций камеры — система определяла позиции камеры на основе загруженных материалов, после чего пользователь мог вручную корректировать данные.",
        "Финальная калибровка — обработка информации на сервере с последующим выводом статистики в виде графиков и данных, доступных для скачивания в различных форматах."
      ]
    },
    "challenges": {
      "header": "Основные задачи и вызовы",
      "paragraphs": [
        "Одной из сложных задач было создание интуитивно понятного интерфейса для калибровки. Процесс требовал высокой точности, поэтому дизайн должен был помогать пользователям легко ориентироваться в сложных шагах настройки камеры.",
        "Я участвовал в подключении SSO через Keycloak, а также реализовал поллинг для корректного отображения статусов калибровки во время взаимодействия пользователя с системой."
      ]
    },
    "commercial": {
      "header": "Коммерческое применение",
      "paragraph": "Этот проект разрабатывался как коммерческий продукт, предлагающий более удобный и точный метод калибровки камер. Мы планировали продавать его как инновационное решение для профессиональных пользователей в области 3D-моделирования, медицины и других высокоточных сфер."
    }
  }
}