{
  "radiant" : {
    "aboutProject": {
      "header": "プロジェクトについて",
      "paragraph": "このプロジェクトは、デジタル一眼レフカメラ、モバイルデバイスのカメラ、医療用カメラ、その他の特殊な撮影機器など、さまざまな種類のカメラをキャリブレーションするためのウェブアプリケーションです。主な目的は、画像分析と計算を通じてカメラを正確に調整するための直感的なツールをユーザーに提供することでした。"
    },
    "calibrationProcess": {
      "header": "キャリブレーションのプロセス",
      "subheader": "キャリブレーションのプロセスは以下の手順で構成されていました。",
      "list": [
        "モニターデータの入力 – ユーザーが画面サイズと解像度を指定し、テストパターンのスケーリングを正確に行う。",
        "パターンの生成 – システムはQRコード付きの白黒パターンを作成し、フレームの順序を識別。",
        "キャリブレーションプロセスの記録 – ウェブサイト上でプレゼンテーションを開始し、1秒ごとにパターンが変化。ユーザーはカメラを固定した状態で記録。",
        "写真や動画のアップロード – キャリブレーションのため、異なる角度から複数回撮影し、データをアップロード。",
        "カメラ位置の分析 – システムがアップロードされたデータからカメラの位置を特定し、手動で調整可能。",
        "最終キャリブレーション – サーバーでデータを処理し、グラフやダウンロード可能なレポートを出力。"
      ]
    },
    "challenges": {
      "header": "主な課題と解決策",
      "paragraphs": [
        "キャリブレーションプロセスは非常に精度が求められるため、直感的で分かりやすいUIの設計が大きな課題でした。",
        "Keycloakを使用したSSOの統合、およびポーリングを実装して、キャリブレーションのステータスをリアルタイムで管理しました。"
      ]
    },
    "commercial": {
      "header": "商用展開",
      "paragraph": "このプロジェクトは、3Dモデリング、医療、その他の高精度分野向けの革新的なソリューションとして市場に投入される予定の商業製品でした。"
    }
  },
  "ciCraft": {
    "aboutProject": {
      "header": "プロジェクトについて",
      "paragraph": "Ci Craft（シークラフト）は中国語の漢字を学ぶために開発されたモバイル教育ゲームです。VK（ロシアのSNS）上のミニアプリとして提供され、「漢字を組み立てる」という創造的なメカニクスを通じて中国の文字体系を学ぶアプローチを取りました。ビジュアルデザインは古代中国をモチーフに、温かいオレンジ色を基調としています。"
    },
    "gameplay": {
      "header": "ゲームプレイ",
      "paragraph": "プレイヤーはレベル（漢字パック）を選びます。目的は、基本的な康煕部首（漢字の構成要素）を組み合わせて、より複雑な漢字を作成することです。部首は画面下部でカルーセルのようにスクロールし、プレイヤーはそれらをワークスペースにドラッグし、正しく組み合わせると、完成した漢字となって個人辞書に自動的に追加されます。"
    },
    "dictionary": {
      "header": "辞書と学習",
      "paragraph": "Ci Craftには内蔵辞書があり、ユーザーは以下のことができます：各レベルで学んだ漢字を確認する、自分のフォルダに好きな漢字を追加する、各漢字の由来に関する短い説明を読む。このゲームは記憶力や視覚的認識を鍛えるだけでなく、自分だけの漢字リファレンスを作る助けにもなります。"
    },
    "audience": {
      "header": "対象ユーザー",
      "paragraph": "このゲームは、初めて中国語を学ぶ人や復習したい人など、子供から大人まで幅広い層を対象に開発されました。シンプルなインターフェースと楽しい進行によって、年齢やスキルレベルに関係なく誰でも使える設計になっています。"
    },
    "myRole": {
      "header": "プロジェクトでの役割",
      "list": [
        "辞書モジュールと漢字カードのUIの開発",
        "すべての画面レイアウトのデザイン（UI設計）",
        "ゲームプレイに関するバグの修正",
        "管理パネルの構築（React + Firebase）"
      ]
    },
    "technicalChallenges": {
      "header": "技術的課題",
      "paragraph": "このプロジェクトはReact Ionic上で構築され、Firebaseがデータベースとして使用されました。VK APIとの統合によりSNS内で実行可能でした。主な課題の一つはクロスプラットフォーム対応であり、iOS特有の制限（セキュリティやコンポーネント動作）には独自の解決策が必要でした。"
    },
    "results": {
      "header": "結果",
      "paragraph": "VK上の限られたユーザーを対象にテスト公開を実施しました。アイデアとビジュアルについては好評でしたが、レベル数の少なさとゲーミフィケーション要素の不十分さにより、開発は中止されました。"
    },
    "meaning": {
      "header": "プロジェクトの意義",
      "paragraph": "Ci Craftは私にとって初めての本格的な開発プロジェクトでした。チームでの開発を学び、モバイル向けのUI開発に取り組み、UX設計のスキルを広げることができました。"
    }
  },
  "bretzel": {
    "aboutProject": {
      "header": "プロジェクトについて",
      "paragraph": "Bretzelは、ドイツの大手企業の従業員向けに開発された社内用ウェブアプリケーションです。主な目的は、さまざまな社内イベントや日常のニーズに対応した便利なフード注文サービスを提供することでした。アプリはモバイルとデスクトップの両方に対応しており、従業員はどのデバイスからでも簡単に注文できます。"
    },
    "mainFunctionality": {
      "header": "主な機能",
      "paragraph": "ユーザーはイベントタイプ（カフェテリア、朝食、BBQ、コーヒーブレイク、フィンガーフード、ピザセッションなど）を選択し、場所、日付、時間を入力します。メニューは選択したイベントに合わせて自動的に調整されます。従業員はカートに商品を追加し、注文を支払い、別ページで注文状況を確認できます。アプリのもう一つの部分はシェフ用で、メニューの管理、休日の設定、人気の配達先リストの更新が可能です。"
    },
    "myRole": {
      "header": "私の役割",
      "paragraph": "私はモバイルとデスクトップ両方のインターフェースデザイン全般を担当しました。また、注文手続き、メニューのフィルタリングと表示、カート機能など主要なユーザーシナリオの開発も行いました。"
    },
    "technologies": {
      "header": "技術と特徴",
      "paragraph": "アプリはReactとMobXを使って構築されています。SPAでありながら、多くの条件やシナリオを考慮する必要があり、技術的に複雑なプロジェクトでした。配達日時の正確な処理、注文ステータスの更新、カートやメニューの動的な更新などが求められました。"
    },
    "challenges": {
      "header": "課題と解決策",
      "paragraph": "主な課題の一つは、時間枠や注文ステータスの正確な管理、イベントごとの柔軟なメニューのフィルタリングと更新を実現することでした。これらの機能は、ロジックの綿密な設計とバックエンドチームとの密接な連携が必要でした。"
    },
    "results": {
      "header": "成果",
      "paragraph": "このアプリは社内で好評を博し、現在も利用されています。クライアントも満足し、後に新しいプロジェクトのアイデアを持って再度依頼がありました。"
    }
  },
  "squadReady": {
    "aboutProject": {
      "header": "プロジェクトについて",
      "paragraph": "Squad Ready ITは、アウトソーシングによるソフトウェア開発を専門とする企業のランディングページです。主な目的は新規クライアントの獲得と会社の実績紹介であり、SEOにも力を入れて検索エンジンでの表示順位を高めました。"
    },
    "mainFunctionality": {
      "header": "主な機能",
      "paragraph": "このサイトでは、どんな規模や難易度のプロジェクトにも対応できること、必要に応じて追加の開発者を迅速に採用できることを強調しています。ランディングページには、過去の協力企業や、オリジナルのプロジェクトプレビューイラスト付きの実績紹介ブロックがあります。"
    },
    "myRole": {
      "header": "私の役割",
      "paragraph": "ランディングページ全体のデザイン、プロジェクトプレビュー用イラストの作成、Next.jsによるサイト実装まで、すべて一人で担当しました。"
    },
    "technologies": {
      "header": "技術と特徴",
      "paragraph": "サイトはNext.js、React、MUIコンポーネントライブラリで構築されています。シンプルでミニマルなインターフェースと、ユーザー体験を高める滑らかなアニメーションに特にこだわりました。"
    },
    "challenges": {
      "header": "課題と解決策",
      "paragraph": "アニメーションの実装が特に面白く、数は多くありませんが、プロジェクト切り替え時のスクロールアニメーションなど、サイトに独自性を与えています。"
    },
    "results": {
      "header": "成果",
      "paragraph": "このサイトは会社の経営陣から高く評価され、現在もSquad Ready ITの名刺代わりとして活用されています。リリース後、同様のプロジェクトの依頼も受けました。"
    }
  },
  "kanxiKeys": {
    "aboutProject": {
      "header": "プロジェクトについて",
      "paragraph": "「康熙部首表」は、中国語に興味があるすべての人のために作られたインタラクティブなウェブサイトです。214個の主要な康熙部首を学べるだけでなく、詳細な解説付きのイラストポスターをOzonで購入することもできます。また、中国語学習者向けの有益なコンテンツを発信するVKコミュニティもサイト上で紹介しています。"
    },
    "mainFunctionality": {
      "header": "主な機能",
      "paragraph": "サイトの中心は、214個すべての康熙部首を掲載した便利なインタラクティブ表です。各部首には由来や意味などの詳細な記事が用意されています。部首の検索や画数による並べ替えもでき、直感的で簡単に使えます。右下のヘルプボタンを押すと、インターフェースの説明がモーダルウィンドウで表示されます。"
    },
    "myRole": {
      "header": "私の役割",
      "paragraph": "サイト全体のデザインを担当し、中国らしい雰囲気を柔らかい色合いと繊細なディテールで表現しました。また、アニメーション、バックエンドの設定、検索や画数による並べ替え、モバイル・デスクトップ両対応のUI設計も行いました。"
    },
    "technologies": {
      "header": "技術と特徴",
      "paragraph": "サイトはNext.jsで構築され、データベースにはFirebaseを使用しています。表示速度やレスポンシブ対応、ナビゲーションのしやすさにも特に配慮しました。洗練されたデザインと現代的なインターフェースにより、他の類似サイトと比べて際立っています。"
    },
    "challenges": {
      "header": "課題と解決策",
      "paragraph": "大きな困難はありませんでしたが、デザインやインタラクティブ要素の面で非常にやりがいのあるプロジェクトでした。特に、心地よい雰囲気と本当に使いやすいサイトを実現できたことを誇りに思います。"
    },
    "results": {
      "header": "成果",
      "paragraph": "使いやすさとビジュアルデザインが高く評価され、多くのユーザーから好意的なレビューをいただきました。表の操作が快適で簡単だと好評です。2022年に完成し、現在も利用されています。"
    }
  },
  "planyway": {
    "aboutProject": {
      "header": "プロジェクトについて",
      "paragraph": "Planywayは、TrelloやJiraと連携したタスク・時間管理のための大規模なウェブアプリです。計画、タイムトラッキング、レポート作成などの機能を備えています。"
    },
    "myContribution": {
      "header": "私の貢献",
      "subtitle": "2024年にフロントエンド開発者としてプロジェクトに参加しました。この期間に行ったこと：",
      "list": [
        "新しいユーザー向けオンボーディングを実装",
        "レポートのエクスポート機能を様々な形式に対応して改良",
        "タイムログに「有償・無償時間」パラメータを追加",
        "タスクフィルタリングのメインメニューを再設計",
        "Jira、Trello、Chrome拡張機能との連携をサポート",
        "バックエンド（Node.js）の新機能開発やバグ修正にも参加"
      ]
    },
    "architecture": {
      "header": "アーキテクチャの改善",
      "paragraph": "Feature-Sliced Designアプローチを導入し、プロジェクトの構造化やコードのナビゲーションを簡素化し、保守性と拡張性を向上させました。"
    },
    "challenges": {
      "header": "課題",
      "paragraph": "最大の課題は大量のレガシーコードの理解でした。徐々にプロジェクトをシンプルかつモダンにし、今後の開発がしやすくなっています。"
    }
  }
}